БухЭксп/ChartsOfAccounts/CW_МСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfAccounts>
		<Properties>
			<Name>CW_МСФО</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.CW_ВидыСубконтоМСФО</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользованиеВРучныхОперациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

БухЭксп/ChartsOfAccounts/CW_МСФО/Forms/ФормаСчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.УчетПоПодразделениям.Доступность = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	УстановитьВидимостьКолонокСвойстСубконто();	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СтрокаПорядка = "";
	ПланыСчетов.CW_МСФО.ПолучитьСтрокуПорядка(ТекущийОбъект, СтрокаПорядка);
	ТекущийОбъект.Порядок = СтрокаПорядка; 
	
КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьКолонокСвойстСубконто()
	
	Элементы.ВидыСубконтоВалютный.Видимость 		= Объект.Валютный;
	Элементы.ВидыСубконтоКоличественный.Видимость 	= Объект.Количественный;
	
КонецПроцедуры

&НаСервере
Процедура ВалютныйПриИзмененииНаСервере()
	
	Если Не Объект.Валютный Тогда
		Для каждого СтрокаСубконто из Объект.ВидыСубконто Цикл
			СтрокаСубконто.Валютный = ложь;
		КонецЦикла;
	Конецесли;
	
	УстановитьВидимостьКолонокСвойстСубконто();
	
КонецПроцедуры

&НаСервере
Процедура КоличественныйПриИзмененииНаСервере()
	
	Если Не Объект.Количественный Тогда
		Для каждого СтрокаСубконто из Объект.ВидыСубконто Цикл
			СтрокаСубконто.Количественный = ложь;
		КонецЦикла;
	Конецесли;
	
	УстановитьВидимостьКолонокСвойстСубконто();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютныйПриИзменении(Элемент)
	
	ВалютныйПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличественныйПриИзменении(Элемент)
	
	КоличественныйПриИзмененииНаСервере();
	
КонецПроцедуры
